const questions = [
    // перша частина
    {
        title: 'ЯКИЙ ВНЕСОК Я МОЖУ ЗРОБИТИ У РОБОТУ КОМАНДИ?',
        questions: [
            'Я думаю, що здатен швидко помічати нові можливості та витягувати з них вигоди.',
            'Я можу успішно працювати з найрізноманітнішими людьми.',
            'Генерація ідей — моя вроджена перевага.',
            'Моєю перевагою є вміння знаходити людей, здатних принести користь команді.',
            'Моя здатність доводити все до кінця в багатьох випадках забезпечила мою професійну ефективність.',
            'Я готовий перенести тимчасову непопулярність, якщо бачу, що мої дії в підсумку принесуть корисні результати.',
            'Я швидко з\'ясовую, що спрацює в даній ситуації, якщо в подібну ситуацію я вже потрапляв.',
            'Особисті забобони та упередження не заважають мені знаходити та доводити переваги альтернативних дій.'
        ]
    },
    // друга частина
    {
        title: 'МОЇ НЕДОЛІКИ, ЯКІ МОЖУТЬ ПРОЯВИТИСЯ В КОМАНДНІЙ РОБОТІ:',
        questions: [
            'Я почуваюся невпевнено на нараді, якщо відсутня чітка порядок денний та контроль за її дотриманням.',
            'Я схильний бути занадто великодушним до людей, які мають правильну точку зору, але не висловлюють її відкрито.',
            'Я схильний занадто багато говорити, коли в групі обговорюються нові ідеї.',
            'Через мою обережність я не схильний швидко та з ентузіазмом приєднуватися до думки колег.',
            'Іноді я виглядаю авторитарним та нетерпимим, коли відчуваю необхідність досягти чогось.',
            'Мені важко повести людей за собою, оскільки я занадто піддатливий впливу атмосфери, що панує в групі.',
            'Я занадто захоплений ідеями, які мені приходять в голову, і тому погано слідкую за тим, що відбувається навколо.',
            'Мої колеги вважають, що я занадто багато уваги приділяю деталям і надмірно хвилююся про те, що справи йдуть неправильно.'
        ]
    },
    // третя частина
    {
        title: 'УЧАСТЬ У СПІЛЬНОМУ ПРОЕКТІ:',
        questions: [
            'Я вмію впливати на людей, не чинячи на них тиску.',
            'Вроджена обережність оберігає мене від помилок, що виникають через неуважність.',
            'Я готовий чинити тиск, щоб нарада не перетворилася на марну трату часу та не втратила з виду основну мету обговорення.',
            'Можна розраховувати на надходження від мене оригінальних пропозицій.',
            'Я завжди готовий підтримати будь-яку пропозицію, якщо вона служить загальним інтересам.',
            'Я енергійно шукаю серед нових ідей та розробок найсвіжіші.',
            'Я сподіваюся, що моя здатність виносити неупереджені судження визнається всіма, хто мене знає.',
            'На мене можна покласти обов\'язки слідкувати за тим, щоб найважливіша робота була організована належним чином.'
        ]
    },
    // четверта частина
    {
        title: 'Особливості мого стилю роботи в команді:',
        questions: [
            'Я постійно намагаюся краще пізнати своїх колег.',
            'Я неохоче заперечую своїм колегам і не люблю сам бути в меншості.',
            'Я зазвичай знаходжу вагому аргументацію проти поганих пропозицій.',
            'Я вважаю, що володію талантом швидко організувати виконання затверджених планів.',
            'Я володію здатністю уникати очевидних рішень і вмію знаходити несподівані.',
            'Я прагну досягти досконалості при виконанні будь-якої ролі в командній роботі.',
            'Я вмію встановлювати контакти з зовнішнім оточенням команди.',
            'Я здатний сприймати будь-які висловлювані думки, але без коливань підкоряюся думці більшості після прийняття рішення.'
        ]
    },
    // п'ята частина
    {
        title: 'Я ОТРИМУЮ ЗАДОВОЛЕННЯ ВІД РОБОТИ, ТОМУ ЩО:',
        questions: [
            'Мені доставляє задоволення аналіз ситуацій та зважування всіх шансів.',
            'Мені подобається знаходити практичні рішення проблем.',
            'Мені подобається усвідомлювати, що я створюю хороші робочі взаємовідносини.',
            'Я здатний чинити сильний вплив на прийняття рішень.',
            'Я отримую можливість зустрітися з людьми, здатними запропонувати щось нове для мене.',
            'Я здатний домогтися згоди людей на реалізацію необхідного курсу дій.',
            'Я відчуваю себе в своїй стихії, коли можу приділити завданню все мою увагу.',
            'Мені подобається знаходити завдання, що вимагають напруження уяви.'
        ]
    },
    // шоста частина
    {
        title: 'Якщо мені несподівано запропонують вирішити складне завдання за обмежений час з незнайомими людьми, то:',
        questions: [
            'Я б відчув необхідність спочатку на самоті обдумати шляхи виходу з глухого кута, перш ніж почати діяти.',
            'Я був би готовий працювати з людиною, яка вказала найбільш позитивний підхід, якими б не були пов\'язані з цим труднощі.',
            'Я б спробував знайти спосіб розділення завдання на частини відповідно до того, що найкраще вміють робити окремі члени команди.',
            'Притаманна мені відповідальність допомогла б нам не відставати від графіка.',
            'Я сподіваюся, мені вдалося б зберегти холоднокровність та здатність логічно мислити.',
            'Я б наполегливо домагався досягнення мети, незважаючи ні на які перешкоди.',
            'Я був би готовий діяти силою позитивного прикладу при появі ознак відсутності прогресу в командній роботі.',
            'Я б організував дискусію, щоб стимулювати висунення нових ідей та надати початковий імпульс командній роботі.'
        ]
    },
    // сьома частина
    {
        title: 'ПРОБЛЕМИ, З ЯКИМИ Я СТИКАЮСЯ, ПРАЦЮЮЧИ В КОМАНДІ:',
        questions: [
            'Я схильний проявляти нетерпимість стосовно людей, які заважають, на мою думку, прогресу в справах групи.',
            'Оточуючі іноді критикують мене за надмірний раціоналізм та неспроможність до інтуїтивних рішень.',
            'Моє прагнення забезпечити умови, щоб робота виконувалася правильно, може призводити до зниження темпів.',
            'Я занадто швидко втрачаю ентузіазм та намагаюся черпати його у найактивніших членів групи.',
            'Я важко на підйом, якщо не маю чітких цілей.',
            'Мені іноді буває дуже важко розібратися у зустрічних мені складнощах.',
            'Я соромлюся звернутися за допомогою до інших, коли не можу щось зробити сам.',
            'Я відчуваю труднощі при обґрунтуванні своєї точки зору, коли стикаюся з серйозними запереченнями.'
        ]
    },
];

const questionLength = questions.length;

export { questions, questionLength };