// images
import collectivist from '../assets/Roles/collectivist.jpg';
import dovodchik from '../assets/Roles/dovodchik.jpg';
import formirovatel from '../assets/Roles/formirovatel.jpg';
import ispolnitel from '../assets/Roles/ispolnitel.jpg';
import mislitel from '../assets/Roles/mislitel.jpg';
import ozenchik from '../assets/Roles/ozenchik.jpg';
import predsedatel from '../assets/Roles/predsedatel.jpg';
import razvedchik from '../assets/Roles/razvedchik.jpg';

const roles: any = {

    'Доводчик': {
        haracteristic: 'Добре планує, виконує та доводить завдання до кінця',
        functionality: 'Наполягає заради просування вперед, витримує терміни',
        weakness: 'Втрачає задоволення від роботи, коли робота не завершена',
        image: dovodchik,
        description: 'Старанний та сумлінний. Шукає помилки та пропуски. Контролює терміни виконання доручень. Зазвичай про успіх команди судять за остаточними результатами її роботи. При цьому багато людей майже патологічно не можуть довести розпочате ними до кінця, і вміння завершувати розпочате є досить рідкісною якістю. Доводчики — це люди, що володіють цим даром у повній мірі'
    },

    'Председатель': {
        haracteristic: 'Зрілий. Впевнений у собі, довірливий',
        functionality: 'Роз\'яснює цілі та встановлює пріоритети. Оцінює завдання відповідно до цілей команди',
        weakness: 'Не дуже інтелігентний, особистість не високо творча',
        image: predsedatel,
        description: 'Це сильне домінування та відданість груповим цілям. Стиль керівництва командою Председателя — радушно приймати внески у діяльність команди та оцінювати їх відповідно до цілей команди. Вміє чітко формулювати цілі, просуває рішення, делегує повноваження. Має ясне уявлення про сильні та слабкі сторони команди та максимально використовує потенціал кожного члена команди'
    },

    'Формирователь': {
        haracteristic: 'Дуже сильна особистість. Комунікабельний, динамічний',
        functionality: 'Формує зусилля команди через встановлення цілей, пріоритетів',
        weakness: 'Схильний до провокацій, роздратування, нетерпіння',
        image: formirovatel,
        description: 'Формувальники завжди виступають як підбадьорювачі до дії, і якщо команда схильна до бездіяльності або самозадоволення, то присутність Формувальника виведе її з цього стану. Такий лідер — динамічний, кидає виклик, чинить тиск.'
    },

    'Мыслитель': {
        haracteristic: 'Інтроверт. Розумний. Неординарний',
        functionality: 'Вносить інноваційні ідеї у роботу команди та її цілі',
        weakness: 'Схильний «літати в хмарах» та ігнорувати деталі',
        image: mislitel,
        description: 'Інтровертивний тип генератора ідей. Винахідливий, має багату уяву — людина з ідеями, що вміє вирішувати нетипові проблеми. Зазвичай Мислителі діють наодинці, сидячи у своєму кутку та обмірковуючи різні варіанти. Володіють високим інтелектуальним рівнем та дуже високим показником креативності.'
    },

    'Разведчик': {
        haracteristic: 'Екстраверт. Знає, хто може допомогти вирішити проблеми та завжди у пошуках нових ідей',
        functionality: 'Створює мережу контактів та збирає корисні ресурси для команди',
        weakness: 'Втрачає інтерес у міру згасання первісного ентузіазму',
        image: razvedchik,
        description: 'Екстравертивний тип генератора ідей. Ентузіаст, комунікабельний. Це ще один член команди, орієнтований на пропозицію нових ідей. Однак, спосіб генерації ідей Розвідниками та сам характер пропонованих ними ідей відрізняються від мислителів. Вони схильні не стільки самі пропонувати оригінальні ідеї, скільки «підбирати» фрагменти ідей оточуючих та розвивати їх.'
    },

    "Оценщик": {
        haracteristic: 'Тверезо оцінює обстановку. Об\'єктивний при аналізуванні проблем та оцінці ідей',
        functionality: ' Захищає команду від прийняття імпульсивних, відчайдушних рішень. Оцінює ідеї',
        weakness: 'Не вистачає натхнення або здатності мотивувати інших',
        image: ozenchik,
        description: 'Розсудливий, проникливий, має стратегічне мислення. Бачить усі альтернативи, все зважує — інспектор. Оцінщик об\'єктивний при аналізі проблем та оцінці ідей. Рідко охоплений ентузіазмом, він захищає команду від прийняття імпульсивних, відчайдушних рішень. Представники цієї ролі яскраво не проявляють себе в команді до тих пір, поки не настає час прийняття важливих рішень'
    },

    "Коллективист": {
        haracteristic: 'У роботі та житті найважливіше — підтримання відносин',
        functionality: 'Покращує міжособистісне спілкування, зводить до мінімуму конфлікти в команді',
        weakness: 'Нерішучий у момент кризи',
        image: collectivist,
        description: 'М\'який, сприйнятливий, дипломатичний. Вміє слухати, запобігає тертям членів команди — чутливий стосовно і до індивідів, і до ситуацій. Колективіст грає орієнтовану на відносини, підтримуючу роль у команді'
    },


    "Исполнитель": {
        characteristic: 'Систематичний, надійний, організований',
        functionality: 'Організовує роботу команди, виконує завдання, які інші не хочуть виконувати',
        weakness: 'Брак гнучкості, обережний та не любить неперевірені ідеї',
        image: ispolnitel,
        description: 'Основною якістю Виконавців є дисциплінованість; інші природні здібності чи інтелект майже завжди є другорядними у їхньому випадку. Стиль Виконавця в команді — організація робіт. Виконавці надійні, консервативні та ефективні. Вони мають внутрішню стабільність та низький рівень тривожності. Працюють переважно на команду, а не заради задоволення власних інтересів. Вміють реалізовувати ідеї у практичні дії.'
}
};


// первая цифра - номер страницы( начинаються с 0),
// вотрая цира - номер вопроса ( начинаються с 0)
const keys: any = {
    'Доводчик': [
        '06',
        '10',
        '27',
        '33',
        '41',
        '55',
        '64'
    ],
    'Председатель': [
        '03',
        '11',
        '20',
        '37',
        '45',
        '52',
        '66'
    ],
    'Формирователь': [
        '05',
        '14',
        '22',
        '31',
        '43',
        '56',
        '60'
    ],
    'Мыслитель': [
        '02',
        '16',
        '23',
        '34',
        '47',
        '50',
        '65'
    ],
    'Разведчик': [
        '00',
        '12',
        '25',
        '36',
        '44',
        '57',
        '63'
    ],
    'Оценщик': [
        '07',
        '13',
        '26',
        '32',
        '40',
        '54',
        '61'
    ],
    'Коллективист': [
        '01',
        '15',
        '24',
        '30',
        '42',
        '51',
        '67'
    ],
    'Исполнитель': [
        '04',
        '17',
        '21',
        '35',
        '46',
        '53',
        '62'
    ]
}

export { roles, keys };